app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "StefonSimmons"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by_username(login_params[:username])