app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1  [["poem_id", 13]]
SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1 AND "likes"."user_id" = $2  [["poem_id", 19], ["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1 AND "likes"."user_id" = $2  [["poem_id", 10], ["user_id", 1]]
---
  def index
    @likes = Like.where(poem_id: params[:poem_id])
    @mine = @likes.where(user_id: params[:user_id]).length()

    render json: {count: @likes.length(), mine: @mine}

SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1  [["poem_id", 24]]
SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1 AND "likes"."user_id" = $2  [["poem_id", 24], ["user_id", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 57]]
SELECT "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
INSERT INTO "likes" ("user_id", "poem_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["poem_id", 24], ["created_at", "2020-09-23 20:56:52.811909"], ["updated_at", "2020-09-23 20:56:52.811909"]]
---
  def create
    @likes = Like.where(poem_id: params[:poem_id])
    @mine = @likes.where(user_id: params[:user_id])

    if already_liked?
      @like.destroy
      render json: {count: @likes.length(), mine: @mine.length()}
    else
      @poem = Poem.find(params[:poem_id])
      @poem.likes.create(user_id: params[:user_id])
      render json: {count: @likes.length(), mine: @mine.length()}

SELECT "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
SELECT "poems".* FROM "poems" WHERE "poems"."user_id" = $1 ORDER BY "poems"."id" DESC  [["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."poem_id" = $1 AND "likes"."user_id" = $2  [["poem_id", 24], ["user_id", 1]]
---
    def set_like
      @poem = Poem.find(params[:poem_id])
      @like = @poem.likes.where(user_id: params[:user_id])[0]

SELECT 1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."poem_id" = $2 LIMIT $3  [["user_id", 1], ["poem_id", 24], ["LIMIT", 1]]
---
    def already_liked?
      Like.where(user_id: params[:user_id], poem_id: params[:poem_id]).exists?