app/controllers/poems_controller.rb

SELECT "poems".* FROM "poems" ORDER BY "poems"."id" DESC
---
  def index
    @poems = Poem.all

INSERT INTO "poems" ("text", "user_id", "created_at", "updated_at", "title", "username") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @poem = Poem.new(poem_params)

    if @poem.save

DELETE FROM "poems" WHERE "poems"."id" = $1  [["id", 50]]
---
  def destroy
    @poem.destroy

SELECT "poems".* FROM "poems" WHERE "poems"."user_id" = $1 ORDER BY "poems"."id" DESC  [["user_id", 1]]
---
  def user_poems
    @poems = Poem.where(user_id: params[:user_id])

SELECT "poems".* FROM "poems" WHERE (LOWER(title) LIKE '%j%'
---
  def search_poems
    print params[:keyword]
    @poems = Poem.where("title LIKE ? OR text LIKE ?", "%#{params[:keyword]}%", "%#{params[:keyword]}%")

SELECT "poems".* FROM "poems" WHERE "poems"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
---
    def set_poem
      @poem = Poem.find(params[:id])